#include <QCoreApplication>
#include "nodeofexprtree.h"

int main(int argc, char *argv[])
{
    QCoreApplication a(argc, argv);

    // Получить строку постфиксной записи выражения из исходного файла


    // Из постфиксной записи выражения получить дерево этого выражения


    // Если найдена ошибка
    // Вывести сообщение об ошибке и завершить программу


    // Получить инфиксную запись выражения из дерева этого выражения


    // Вывести в выходной файл инфиксную запись выражения


    // Если не найдена ошибка записи:
    // Вывести сообщение об ошибке и завершить программу


    // Перенести все слагаемые после знака сравнения в левую часть (не)равенства в дереве выражения


    // Расставить все слагаемые и множители в дереве выражения по алфавиту, начиная с корня дерева


    // Из дерева выражения получить инфиксную запись этого выражения


    // Вывести в выходной файл инфиксную запись выражения

    return a.exec();
}


